backend/controllers/ArticlesController.php

SELECT * FROM `articles`
SELECT * FROM `user` WHERE `id`=1
---
    public function actionIndex()
    {
        $articles = Articles::find()->all();

        foreach ($articles as $article)
            $article->user_id = User::find()->where(['id'=>$article->user_id])->one()->username;

SELECT * FROM `articles` WHERE `art_id`='23'
---
    public function actionArticle()
    {
        if( array_key_exists('id', Yii::$app->request->get()) ){
            $article = Articles::find()->where(['art_id'=>Yii::$app->request->get()['id']])->one();

SELECT * FROM `user` WHERE `id`=3
DELETE FROM `articles` WHERE `art_id`='23'
DELETE FROM `comments` WHERE `art_id`='23'
DELETE FROM `likes` WHERE `art_id`='23'
---
    public function actionDelete()
    {
        if( array_key_exists('id', Yii::$app->request->get()) ){
            $art_id = Yii::$app->request->get()['id'];

            if(!Yii::$app->user->isGuest and User::find()->where(['id'=>Yii::$app->user->id])->one()->admin){

                    Articles::deleteAll(['art_id'=>$art_id]);
                    Comments::deleteAll(['art_id'=>$art_id]);
                    Likes::deleteAll(['art_id'=>$art_id]);