backend/controllers/SiteController.php

    public function actionLogin()
    {
        if (!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $this->layout = 'blank';

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post())) {
            $admin = User::find()->where(['username'=>$model->username])->one();
---
SELECT * FROM `user` WHERE `username`='HotPot'