backend/controllers/UsersController.php

SELECT * FROM `user`
---
    public function actionIndex()
    {
        $users = User::find()->all();