frontend/controllers/ArticlesController.php

SELECT COUNT(*) FROM `articles`
SELECT * FROM `articles` LIMIT 1 OFFSET 1
SELECT * FROM `articles` LIMIT 1
SELECT * FROM `user` WHERE `id`=0
---
    public function actionIndex()
    {
        $page_num = 1;
        $page_count = (int)ceil((Articles::find()->count())/ArticlesPerPage);

        if( array_key_exists('page', Yii::$app->request->get()) )
        {
            $page_num   = Yii::$app->request->get()['page'];

            if($page_num>1 and $page_num<=$page_count)
                $articles = Articles::find()->limit(ArticlesPerPage)->offset(($page_num-1)*ArticlesPerPage)->all();
            else
                return $this->redirect('/');
        }
        else
            $articles = Articles::find()->limit(ArticlesPerPage)->all();


        foreach ($articles as $article){
            $article->user_id =  User::find()  -> where( ['id' => $article->user_id] ) -> one() -> username;

SELECT * FROM `articles` WHERE `art_id`='0'
SELECT * FROM `comments` WHERE `art_id`='0'
SELECT * FROM `likes` WHERE (`art_id`='0') AND (`user_id` IS NULL)
---
    public function actionArticle()
    {
        if(Yii::$app->request->isPost)
        {
            if(Yii::$app->request->post()["NewComment"]['text'] != ""){
                $comment = new Comments();

                $comment->art_id  = Yii::$app->request->get()['id'];
                $comment->text    = substr(Yii::$app->request->post()["NewComment"]['text'],  0, 255);
                $comment->user_id = Yii::$app->user->id;
                $comment->date    = date('Y-m-d');

                $comment->save();
            }

            return $this->redirect(Yii::$app->getRequest()->getUrl());
        }

        $article    = Articles::find()->where( ['art_id' => Yii::$app->request->get()['id']] ) -> one();
        $comments   = Comments::find()->where( ['art_id' => Yii::$app->request->get()['id']] ) -> all();
        $liked = Likes::find() -> where( ['art_id' => $article->art_id, 'user_id'=>Yii::$app->user->id]) -> one();

UPDATE `articles` SET `views`=35 WHERE `art_id`=0
SELECT * FROM `user` WHERE `id`=1
---
        }

        $article->views += 1;
        $article->update();

        $article->user_id = User::find() -> where( ['id' => $article->user_id] ) -> one() -> username;

SELECT * FROM `articles` WHERE `art_id`='0'
SELECT * FROM `likes` WHERE (`art_id`='0') AND (`user_id`=2)
INSERT INTO `likes` (`art_id`, `user_id`, `state`) VALUES (0, 2, 1)
UPDATE `likes` SET `state`=1 WHERE `id`=4
UPDATE `articles` SET `likes`=1 WHERE `art_id`=0
---
    public function actionLike()
    {
        if (Yii::$app->user->isGuest) die();

        if(Yii::$app->request->isPost) { #POST request
            if(Yii::$app->request->post()["art_id"] != ""){ #contains art_id

                $art = Yii::$app->request->post()["art_id"];
                $article = Articles::find()->where([ 'art_id' => $art ])->one();
                if($article != null){ #article exists
                    $id  = Yii::$app->user->id;

                    $like = Likes::find()->where([ 'art_id' => $art, 'user_id' => $id ]) -> one();

                    if($like==null){
                        $like = new Likes();
                        $like->art_id = $art;
                        $like->user_id = $id;
                        $like->state = true;
                        $like->save();
                        $article->likes += 1;
                    }
                    else {
                        $like->state = !$like->state;
                        $like->update();
                        $article->likes += $like->state ? 1 : -1;
                    }

                    $article->update();