backend/views/users/users.php

SELECT COUNT(*) FROM `articles` WHERE `user_id`=1
SELECT COUNT(*) FROM `comments` WHERE `user_id`=1
SELECT COUNT(*) FROM `likes` WHERE `user_id`=1
---
	     		<div class="block_item" style="width: 5%;" > <?= $user->id ?>       </div>
		      	<div class="block_item" style="width: 61%;"> <?= $user->username ?> </div>
		      	<div class="block_item" style="width: 8%;">
		      		<?= Articles::find()->where(['user_id'=>$user->id])->count() ?> </div>
		     	<div class="block_item" style="width: 8%;">
		     		<?= Comments::find()->where(['user_id'=>$user->id])->count() ?> </div>
		     	<div class="block_item" style="width: 8%;" >
		     		<?= Likes::find()->where(['user_id'=>$user->id])->count() ?>    </div>